---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussOverlappingReference
source: html/967c300a-079c-5964-c395-9124631c8de1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussOverlappingReference Property

Truss references (chains of one or more reference lines) cannot overlap themselves in the vertical direction.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussOverlappingReference { get; }
```